/*
Localizable.strings
Nova

Created by Logan Collins on 12/4/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"OK" = "OK";
"Cancel" = "取消";
"None" = "无";

"Off" = "关闭";
"On" = "打开";
"Cut" = "剪切";
"Copy" = "拷贝";
"Paste" = "粘贴";
"Move" = "移动";
"Duplicate" = "复制";
"Duplicate “%@”" = "复制“%@”";
"Delete" = "删除";
"Rename" = "重新命名";
"Add" = "添加";
"Remove" = "移除";
"Remove “%@”" = "移除“%@”";
"Insert" = "插入";
"Open" = "打开";
"Close" = "关闭";
"Terminate" = "终止";
"Import" = "导入";
"Export" = "导出";
"Accept" = "接受";
"Connect" = "连接";
"Disconnect" = "断开连接";
"Default" = "默认";
"Always" = "始终";
"Never" = "永不";
"Ignore" = "忽略";

"Clear Menu" = "清除菜单";
"No Selection" = "未选择";
"No Value" = "无值";
"Unknown" = "未知";

"New" = "新建";
"Choose" = "选取";
"Choose…" = "选取…";
"Continue" = "继续";

"Delete…" = "删除…";
"Delete “%@”…" = "删除“%@”…";

"Edit…" = "编辑…";
"Edit “%@”…" = "编辑“%@”…";

"Next" = "下一步";
"Previous" = "上个";
"Finish" = "结束";

"Undo" = "撤销";
"Redo" = "重做";

"Loading…" = "正在加载…";

"Create…" = "创建…";

"Custom" = "自定义";

"Search" = "搜索";
"Share" = "共享";

"Back" = "上一步"; // As in nagivation
"Forward" = "向前";  // As in nagivation
"Show All" = "全部显示";

"Username" = "用户名";
"Password" = "密码";
"Key" = "密钥";
"Passphrase" = "密码短语";
"Token" = "令牌";

"Are you sure you want to remove “%@”?" = "您确定要移除“%@”吗？";
"Are you sure you want to remove %@ items?" = "您确定要移除 %@ 项吗？";
"This action cannot be undone." = "此操作不能撤销。";

"%@ (Default)" = "%@（默认）";

"(optional)" = "（可选）";

"Name:" = "名称：";
"Where:" = "位置：";

"System Monospace" = "系统等宽";
"Font Options" = "字体选项";
"This font has no optional features available." = "此字体不提供可选功能。";
"Increase Font Size" = "增大字号";
"Decrease Font Size" = "缩小字号";

"Start Logging…" = "开始记录…";
"Stop Logging" = "停止记录";

"Enabling terminal logging will log all output for this terminal to a file." = "启用终端日志记录会将此终端的所有输出记录到文件。";
"Terminal logs are helpful when troubleshooting terminal issues with Panic's technical support team. To end terminal logging, choose \"Stop Logging\" from the Terminal menu or quit Nova." = "与 Panic 技术支持团队一起排除终端问题时，终端日志非常有用。要结束终端记录，从终端菜单中选择“停止记录”或退出 Nova。";

"Start" = "开始";

"Zoom In" = "放大";
"Zoom Out" = "缩小";
"Zoom to Fit" = "缩放以适合";
"Actual Size" = "实际大小";

"ON" = "打开";
"OFF" = "关闭";

"Scroll Left" = "向左滚动";
"Scroll Right" = "向右滚动";

"Multiple Selection" = "多选";
"No Selection" = "未选择";


// About
// __VERIFIER_IGNORE__ Used by PanicCore with PCAppLocal
"HomepageURL" = "https://www.panic.com/nova/";
// __END_VERIFIER_IGNORE__

"ABOUT_BOX_COPYRIGHT" = "© Panic Inc.";
"Released on %@" = "发行日期 %@";
"Build Number %@" = "编译 %@"; // Differentiated from "Build <<TaskName>>", which is a different semantic
"Need Help? Visit our support library." = "需要帮助？访问我们的支持库。";
"Acknowledgments" = "致谢";

"Licensed to:" = "许可给：";
"Unregistered. You have %@ trial days remaining." = "未注册。您还剩 %@ 天试用。";
"Unregistered. You have 1 trial day remaining." = "未注册。您还剩 1 天试用。";
"Unregistered. Your trial has ended." = "未注册。您的试用已结束。";

"Remove License" = "移除许可证";
"Unlock %@…" = "解锁 %@…";

"You're receiving free updates until %@." = "您在接收免费更新，截止日期为 %@。";
"Your year of free updates ended on %@." = "您的一年免费更新终止于 %@。";
"Buy the latest Nova to receive a year of free updates." = "购买最新的 Nova 获得一年免费更新。";

"Manage License…" = "管理许可证…";
"Purchase Nova…" = "购买 Nova…";


// License & Trial
"Try Nova for 30 Days" = "试用 Nova 30 天";
"We want to make sure Nova works for you, and we think you'll never go back.\n\nAfter 30 days, Nova will stop working, but you'll be able to export your data.\n\nWhen you buy Nova, you keep it forever — and get one free year of updates." = "我们想确保 Nova 适合您，并认为您永远不会回头。\n\n30 天后，Nova 将停止工作，但您可以导出数据。\n\n购买 Nova 后，您可以永久保有，并获得一年免费更新。";

"You have just %@ days left to test Nova." = "您仅剩 %@ 天来测试 Nova。";
"You have just 1 more day to test Nova." = "您仅剩 1 天来测试 Nova。";
"We hope you’ve been enjoying your trial, and we hope you love Nova. Buy Nova today to ensure your work isn’t rudely interrupted.\n\nWhen you buy Nova, you keep it forever, and get one free year of feature updates and support." = "我们希望您试用愉快，并希望您喜欢 Nova。今天就购买 Nova，以确保工作不会突然中断。\n\n购买 Nova 后，您可以永久保有，并获得一年免费功能更新和支持。";

"Thank you for trying Nova." = "感谢试用 Nova。";
"Your 30 day trial has ended. To continue using Nova, buy it today. When you buy Nova, you keep it forever, and get one free year of feature updates and support." = "您的 30 天试用已经结束。要继续使用 Nova，今天就购买。购买 Nova 后，您将永久保有，同时获得一年免费功能更新和支持。";

"Have A Different License?" = "有一个不同的许可证？";
"Already Purchased?" = "已经购买？";

"Thank you very much for purchasing Nova!" = "非常感谢购买 Nova！";
"All limitations of the unregistered demo version have been removed. Thank you for your purchase! We hope you enjoy Nova." = "未注册的演示版本的所有限制都已移除。感谢购买！希望您喜欢 Nova。";

"To use the latest version of Nova, you must purchase another year of updates." = "要使用最新版本的 Nova，您必须购买另一年的更新。";
"Your purchase of Nova included one full year of free updates, which expired on %@. If you'd like to use the latest Nova updates, buy another year now. You can also re-download the last version available to you." = "您购买的 Nova 包含一整年免费更新，于 %@ 到期。如果您想使用最新的 Nova 更新，现在购买另一年服务。您还可以重新下载对您可用的上个版本。";

"Buy Nova now." = "现在购买 Nova。";
"1 day left. Buy Nova now." = "还剩 1 天。现在购买 Nova。";
"%@ days left. Buy Nova now." = "还剩 %@ 天。现在购买 Nova。";

"This beta version of Nova has expired." = "此测试版的 Nova 已过期。";
"Thanks for your help!" = "感谢您的帮助！";

"Quit" = "退出";

"Could not write to the Nova preferences." = "无法写入 Nova 偏好设置。";
"Make sure the Nova preferences file is unlocked and you have write permissions to it." = "请确保 Nova 首选项文件已解锁，并且您具有写入权限。";

"LicenseSerialInvalidMessage" = "抱歉，这不是有效的 %@ 序列号。"; // %@ is the app name
"LicenseSerialInvalidDescription" = "请确保所有的字母，数字和破折号以正确的顺序输入。如果您要输入数字，可以考虑从您的电子邮件回执中拷贝并粘贴，反之亦然。 (%d)"; // %d is an error code

"LicenseNotAuthorizedMessage" = "提供的许可证编号已过期，无法用于解锁此版本的 %@。"; // %@ is the app name
"LicenseNotAuthorizedDescription" = "要寻找您的许可证支持的最新版本，请访问 %@。"; // %@ is a URL domain

"SerialCheckNetErrorMsg" = "%@ 无法在线验证您的序列号。"; // %@ is the app name
"SerialCheckNetErrorTxt" = "请停用任何可能阻止 %@ 连接到我们的服务器的互联网过滤或防火墙软件，或再次检查您的电脑是否连接到互联网。"; // %@ is the app name

"Try Again" = "再试一次";

// macOS Pre-release Version Alert
"You seem to be running a pre-release version of macOS." = "您似乎正在运行预发布版本的 macOS。";
"While %@ may work without issues, please keep in mind that pre-release OS versions are not fully supported and you may encounter crashes or erratic behavior. We do not recommend using them for production work." = "虽然 %@ 可能会正常工作，但请记住，预发布版本操作系统不受完全支持，您可能会遇到崩溃或不稳定的行为。我们不建议将它们用于生产工作。";


// Colors
"Red" = "红色";
"Orange" = "橙色";
"Yellow" = "黄色";
"Green" = "绿色";
"Viridian" = "铬绿 ";
"Teal" = "蓝绿";
"Sky" = "天蓝";
"Ocean" = "海蓝";
"Azure" = "蔚蓝";
"Amethyst" = "紫晶";
"Pink" = "粉红";
"Magenta" = "洋红色";
"Gray Blue" = "灰蓝";
"Gray Green" = "灰绿";
"Gray Brown" = "灰棕";


// Workspaces
"Workspace" = "工作区";

"New Window" = "新建窗口";

"Close Window" = "关闭窗口";
"Close Window Tab" = "关闭窗口标签页";
"Close Other Window Tabs" = "关闭其他窗口标签页";

"Show Window Tab Bar" = "显示窗口标签页栏";
"Hide Window Tab Bar" = "隐藏窗口标签页栏";

"Show All Window Tabs" = "显示所有窗口标签页";
"Hide All Window Tabs" = "隐藏所有窗口标签页";

"Create a new tab" = "创建新标签页";
"New Tab" = "新建标签页";

"Create a new split" = "创建新分离";
"New Split" = "新分离";

"Show pane options" = "显示窗格选项";
"Pane Options" = "窗格选项";

"Lock Split" = "锁定分离";
"Unlock Split" = "解锁分离";

"Magnify Split" = "放大分离";
"Demagnify Split" = "缩小分离";

"Magnify this split" = "放大此分离";
"Demagnify this split" = "缩小此分离";

"Close this split" = "关闭此分离";

"Recently Closed Tabs" = "最近关闭的标签页";

"Duplicate Tab in Split Above" = "在上面的分离中复制制表符";
"Duplicate Tab in Split Below" = "在下面的分离中复制制表符";
"Duplicate Tab in Split On Left" = "在左边的分离中复制制表符";
"Duplicate Tab in Split On Right" = "在右边的分离中复制制表符";

"Close Tab" = "关闭标签页";
"Close Other Tabs" = "关闭其他标签页";
"Close Tabs to the Right" = "关闭右侧的标签页";
"Move All %@ Tabs To This Pane" = "将所有 %@ 标签页移动到此窗格";
"Move All Tabs With Ancestor" = "移动所有带祖先的标签页";
"Close All Tabs" = "关闭所有标签页";

"Pin Tab" = "固定标签页";
"Unpin Tab" = "取消固定标签页";

"Unpin this tab" = "取消固定此标签页";

"Mute this tab" = "将此标签页静音";
"Unmute this tab" = "取消静音此标签页";

"Sort Tabs by Name" = "按名称对标签页排序";
"Sort Tabs by Type" = "按类型对标签页排序";

"Build" = "编译";
"Run" = "运行";
"Clean" = "清理";
"Stop" = "停止";

"Status" = "状态";

"Choose where to create the project directory." = "选择创建项目目录的位置。";
"Choose where to create the repository clone." = "选择创建存储库克隆的位置。";
"Choose the project directory to add." = "选择要添加的项目目录。";

"Show view options for the window" = "为窗口显示显示选项";
"Show project settings for the window" = "为窗口显示项目设置";

"Are you sure you want to close “%@”?" = "您确定要关闭“%@”吗？";
"Closing this window will stop the task “%@”." = "关闭此窗口将停止任务“%@ ”。";
"Closing this window will stop %@ tasks." = "关闭此窗口将停止 %@ 个任务。";

"Content Not Available" = "内容不可用";
"The content for this tab could not be loaded.\nThis tab may be safely closed." = "无法加载此标签页的内容。\ n此标签页可安全关闭。";

"The name “%@” is not valid." = "名称“%@”无效。";
"The name “%@” is already in use." = "名称“%@”已被使用。";
"Please choose a different name." = "请选取一个不同的名称。";

"Cannot read metadata object from file: “%@”." = "无法从文件读取元数据对象：“％@”。";
"The file does not contain a valid JSON object at its root." = "文件的根目录不包含有效的 JSON 对象。";


// Tabs
"Show All Tabs" = "显示全部标签页";
"Exit Tab Overview" = "退出标签页概览";

"Split Above" = "在上方分离";
"Split Below" = "在下方分离";
"Split on Left" = "在左侧分离";
"Split on Right" = "在右侧分离";


// Sidebars
"Sidebars" = "边栏";
"Show Sidebar" = "显示边栏";
"Show Sidebars" = "显示边栏";
"Show Left Sidebar" = "显示左边栏";
"Show Right Sidebar" = "显示右边栏";
"Hide Sidebar" = "隐藏边栏";
"Hide Sidebars" = "隐藏边栏";
"Hide Left Sidebar" = "隐藏左边栏";
"Hide Right Sidebar" = "隐藏右边栏";

"Show the left sidebar" = "显示左边栏";
"Hide the left sidebar" = "隐藏左边栏";
"Show the right sidebar" = "显示右边栏";
"Hide the right sidebar" = "隐藏右边栏";
"Show the debug pane" = "显示调试窗格";
"Hide the debug pane" = "隐藏调试窗格";

"Sidebar Layout" = "边栏布局";

"New Layout…" = "新布局…";
"Manage Layouts…" = "管理布局…";
"No Layouts" = "无布局";

"Another layout with the name “%@” already exists." = "已存在另一个名为“%@”的布局。";
"Do you want to replace it?" = "您要替换它吗？";

"Left Sidebar" = "左边栏";
"Right Sidebar" = "右边栏";

"All Sidebars" = "全部边栏";

"Drag a sidebar icon here to dock." = "将边栏图标拖到这里进行停靠。";

"This sidebar requires an extension that is not installed. You can try installing it from the extension library." = "此边栏需要的扩展未安装。您可以尝试从扩展库中安装。";

"Show Debug Pane" = "显示调试窗格";
"Hide Debug Pane" = "隐藏调试窗格";

"Hide the Debug Pane" = "隐藏调试窗格";



// Files
"Files Sidebar" = "文件边栏";
"File Browser" = "文件浏览器";

"New File Browser" = "新文件浏览器";

"Local" = "本地";
"Remote" = "远程";

"This folder is empty." = "此文件夹是空的。";

"Filtering…" = "正在过滤…";
"No results found." = "未找到结果。";

"No remote destinations have been added to this project." = "未向此项目添加远程目标。";
"Open a project or server to manage remote files." = "打开一个项目或服务器以管理远程文件。";

"Add Destination…" = "添加目标…";
"Edit Destination…" = "编辑目标…";

"Files: New File" = "文件：新文件";
"Enter the path for the new file." = "为新文件输入路径。";

"Files: New Folder" = "文件：新文件夹";
"Enter the path for the new folder." = "为新文件夹输入路径。";

"Files: Duplicate File" = "文件：复制文件";
"Enter the new path for the duplicate." = "为副本输入新路径。";

"Files: Move File" = "文件：移动文件";
"Files: Rename File" = "文件：重命名文件";
"Enter the new path for the file." = "为文件输入新路径。";
"Enter the new path for the folder." = "为文件夹输入新路径。";

"Show in Files Sidebar" = "在文件边栏中显示";
"Show in Finder" = "在 Finder 中显示";

"Copy Path" = "拷贝路径";
"Copy Relative Path" = "拷贝相对路径";

"Show Hidden Files" = "显示已隐藏的文件";
"Hide Hidden Files" = "隐藏已隐藏的文件";

"Show Ignored Files" = "显示忽略的文件";
"Hide Ignored Files" = "隐藏忽略的文件";

"Are you sure you want to delete “%@”?" = "您确定要删除“%@”吗？";
"Are you sure you want to delete the selected %@ items?" = "您确定要删除所选的 %@ 项吗？";

"The selected items will be deleted immediately." = "所选项目将立即被删除。";
"The selected items will be moved to the Trash." = "所选项目将被移到废纸篓。";

"No Selected Items" = "无所选项";
"No Available Applications" = "无可用的应用程序";

"You are about to open %@ files, do you want to continue?" = "您即将打开 %@ 个文件，要继续吗？";
"Opening many files at once may temporarily degrade performance." = "一次打开多个文件可能暂时降低性能。";

"Go to Project Local Path" = "前往项目本地路径";
"Go to Local “%@”" = "前往本地“%@”";

"Go to Server Remote Path" = "前往服务器远程路径";
"Go to Remote “%@”" = "前往远程“%@”";

"Transcript" = "抄本";
"No Transcripts" = "无抄本";


// Projects
"Project Settings" = "项目设置";

"Project" = "项目";
"Build & Run" = "编译并运行";
"Remote Files" = "远程";
"Extensions" = "扩展";
"Languages & Extensions" = "语言和扩展";

"Global Default" = "全局默认";
"Global Default (%@)" = "全局默认（%@）";

"Stretch" = "伸展";
"Center" = "中心";
"Tile" = "平铺";

"Extension Preferences…" = "扩展首选项…";
"Extension Settings…" = "扩展设置…";


// Authentication
"Authentication Required for “%@”." = "“%@”需要验证。";
"Password Required for “%@”." = "“%@”需要密码。";
"Key Passphrase Required for “%@”." = "“%@”需要密钥密码短语。";
"PIN Required for “%@”." = "“%@”需要 PIN 码。";
"Two Factor Required for “%@”." = "“%@”需要两步验证。";
"SSH Interactive Request" = "SSH 交互请求";
"Username:" = "用户名：";
"Password:" = "密码：";
"Passphrase:" = "密码：";
"Token:" = "令牌：";
"PIN:" = "PIN 码：";
"Key:" = "按键：";
"Code:" = "代码：";

"Select a private key file to use." = "选择一个要使用的专用密钥文件。";


// Connections
"Connecting to “%@”…" = "连接到“%@”…";
"Could not connect to server." = "无法连接到服务器。";
"Could not connect to server “%@”." = "无法连接到服务器“%@”。";

"Not connected." = "未连接。";
"Connection cancelled." = "连接已取消。";
"Retry" = "重试";

"The server “%@” does not have an address specified." = "服务器“%@”没有指定地址。";
"Please specify an address with which to connect." = "请指定要连接的地址。";

"%@ can’t verify the identity of the server “%@”." = "“%@”无法验证服务器“%@”的身份。";

"Host key changed for “%@”." = "“%@”的主机密钥已更改。";
"SSH Host Key Changed Message" = "自上次连接以来，服务器的主机密钥已更改。这很可能是由于服务器发生了更改，您应该联系服务器管理员进行确认。";
"Do you want to accept the host key for “%@”?" = "您要接受“%@”的主机密钥吗？";
"It appears this is the first time you have connected to this host, would you like to continue?" = "这似乎是您第一次连接到该主机，您想继续吗？";
"HostKeyChangedURL" = "https://library.panic.com/general/host-key-changed/";

"The server you are attempting to connect to uses a protocol that is unsupported in this version of %@. Check our website for compatibility information for this protocol." = "您正尝试连接的服务器使用此版本的 %@ 不支持的协议。请查看我们的网站获取此协议的兼容性信息。";

"Save in Keychain" = "存储在钥匙串中";

"A PIN code is required to unlock your secure token." = "需要 PIN 码才能解锁您的安全令牌。";
"Please enter the pin for “%@”." = "请输入“%@”的 PIN 码。";
"PIN" = "PIN 码";


// Task Configurations
"Run" = "运行";
"Tasks" = "任务";
"Edit Task…" = "编辑任务…";

"Building %@" = "正在编译 %@";
"Running %@" = "正在运行 %@";
"Cleaning %@" = "正在清理 %@";

"Add a new task" = "添加新任务";

"Set the active task" = "设置活跃任务";
"No Tasks" = "无任务";

"Build the current task" = "编译当前任务";
"Run the current task" = "运行当前任务";
"Stop the running task" = "停止运行的任务";

"Running Task" = "运行任务";
"Running %@" = "正在运行 %@";

"Task “%@” encountered an uncaught signal." = "任务“%@”遇到一个未捕获的信号。";
"Task “%@” exited with a non-zero exit status: %d." = "任务“%@”以非零退出状态退出： %d.";

"Could not execute the task script." = "无法执行任务脚本。";
"Check to make sure the script has a valid shebang declaration (such as “#!/bin/sh”) for the desired scripting language." = "检查以确保脚本具有所需脚本语言的有效 shebang 声明（例如“#/bin/sh”）。";

"The script does not appear to be executable. Do you want to make it executable?" = "脚本似乎不可执行。您要使其可执行吗？";
"Show Configuration…" = "显示配置…";
"Make Executable" = "设为可执行";

"Do you want to remove the task “%@”?" = "您要移除任务“%@”吗？";

"Stop “%@”?" = "停止“%@”？";
"The task “%@” is already running. Choose “Stop” to terminate and restart it, or “Add” to launch an additional instance." = "任务“%@”已经在运行。选择“停止”将其终止并重启，或“添加”以启动另一实例。";
"The task “%@” is already running. Choose “Stop” to terminate and restart it." = "任务“%@”已经在运行。选择“停止”将其终止并重启。";

"Could not run “%@”." = "无法运行“%@”.";
"The task may be misconfigured or malformed. Check to make sure its settings are correct and not currently in conflict within source control." = "该任务可能配置错误或形式错误。请检查以确保其设置正确，同时当前在源控制中无冲突。";

"Task configuration “%@” not found." = "找不到任务配置“%@”。";
"No task configuration was found in the project with the name “%@”." = "在名称为“%@”的项目中找不到任务配置。";

"The task contains one or more links between other tasks that create an infinite loop." = "此任务包含其它创建无限循环的任务之间的一个或多个链接。";

"The extension assistant with identifier “%@” failed to resolve the action." = "标识符为“%@”的扩展助手无法解析该操作。";

"Task template not found for “%@”." = "未为“%@”找到任务模板。";
"The template for this task was not found in the extension “%@”. Make sure the extension is up to date, or consider contacting the extension author." = "在扩展“%@”中找不到此任务的模板。请确保扩展为最新状态，或考虑联系扩展作者。";

"(Deprecated)" = "（已弃用）";
"This task type is deprecated." = "此任务类型已弃用。";

"This task requires an extension that is not installed. You can try installing it from the extension library." = "此任务需要的扩展未安装。您可以尝试从扩展库中安装。";

"This extension is required in order to run the task “%@”." = "需要此扩展以运行任务“%@”。";

"Build %@" = "编译 %@";
"Run %@" = "运行 %@";
"Clean %@" = "清理 %@";

"Finished Running Task" = "已结束运行任务";
"Finished Running %@" = "已结束运行 %@";

"Build Started" = "编译已开始";
"Build Generated Issues" = "编译产生的问题";
"Build Failed" = "编译失败";
"Build Succeeded" = "编译已成功";

"Clean Started" = "清理已开始";
"Clean Failed" = "清理失败";
"Clean Succeeded" = "清理已成功";

"Task Started" = "任务已开始";
"Task Paused" = "任务暂停";
"Task Generated Issues" = "任务产生的问题";
"Task Generated Output" = "任务产生的输出";
"Task Exited Unexpectedly" = "任务意外退出";
"Task Failed" = "任务失败";
"Task Completed" = "任务已完成";

"Custom Task" = "自定义任务";

"On This Mac" = "在此 Mac 上";
"No SSH Servers" = "无 SSH 服务器";

"Default Remote Interpreter" = "默认远程解释器";

"TASK_VARIABLE_WorkspaceName" = "项目名称";
"TASK_VARIABLE_WorkspaceFolder" = "项目路径";
"TASK_VARIABLE_WorkspaceFolderBasename" = "项目文件夹名称";
"TASK_VARIABLE_BranchName" = "分支名称";

"TASK_VARIABLE_File" = "文件路径";
"TASK_VARIABLE_FileRelative" = "相对文件路径";
"TASK_VARIABLE_FileBasename" = "文件名称";
"TASK_VARIABLE_FileDirname" = "文件父文件夹名称";
"TASK_VARIABLE_FileExtname" = "文件扩展";
"TASK_VARIABLE_LineNumber" = "行编号";
"TASK_VARIABLE_SelectedText" = "所选文本";

"Currently Focused File" = "当前聚焦的文件";

"Extension Command" = "扩展命令";
"Command:" = "命令：";

"Configuration Value" = "配置值";
"Key:" = "按键：";

"%@ Pipeline" = "%@管道";
"The primary step contributed by this task." = "此任务生成的主要步骤。";
"This task does not contribute a primary step to this pipeline." = "此任务不对该管道生成主要步骤。";

"Unknown Action" = "未知操作";
"This action is of an unknown type and may have been added by a newer version of %@." = "此操作的类型未知，可能由较新版本的 %@ 添加。";

"Step %@ of %@" = "步骤 %@ / %@";

"Run Script" = "运行脚本";
"Run Task" = "运行任务";
"Run Another Task" = "运行其他任务";
"Play Sound" = "播放声音";
"Speak Text" = "朗读文本";


// Publishing
"Publish" = "发布";
"Publishing" = "发布";

"Publish files to a remote server" = "发布文件到远程服务器";

"Do you want to remove the remote destination “%@”?" = "您要移除远程目标“%@”吗？";

"No Servers" = "无服务器";
"No server was found in your preferences with the name “%@”." = "在首选项中未找到名称为“%@”的服务器。";
"Multiple servers were found in your preferences with the name “%@”." = "在首选项中找到多个名称为“%@”的服务器。";

"Add a new remote destination" = "添加远程目标";

"No Destinations" = "无目标";
"Add a new destination to your Project Settings to enable publishing." = "向“项目设置”添加新目标，已启用发布。";

"No changes to publish." = "没有要发布的更改。";
"No remote destinations have been added to this project." = "未向此项目添加远程目标。";
"Publishing can only be enabled for a project with a local folder." = "发布只能为带有本地文件夹的项目启用。";

"Publish All" = "发布全部";
"Publish Checked" = "发布已检查";

"Clear" = "清除";
"Clear All" = "清理全部";
"Clear Checked" = "清除所选项";

"Are you sure you want to clear “%@” marked for publishing?" = "您确实要清除标记为要发布的 “%@”吗？";
"Are you sure you want to clear %@ files marked for publishing?" = "您确实要清除标记为要发布的 %@ 个文件吗？";

"Publish Selected Items…" = "发布所选项…";
"Publish “%@”…" = "发布“%@”…";

"Publish All Changes to “%@”…" = "发布全部更改到“%@”…";
"Publish All Checked Changes to “%@”…" = "发布全部已检查更改到“%@”…";

"Publish Selected Items" = "发布所选项";
"Publish Selected Items to “%@”" = "发布所选项到“%@”";
"Publish “%@” to “%@”" = "将“%@”发布到“%@”";

"Reverse Publish Selected Items" = "反向发布所选项";
"Reverse Publish “%@” to “%@”" = "反向发布“%@”到“%@”";

"Are you sure you want to publish “%@” to “%@”?" = "您确定要向“%@”发布“%@”吗？";
"Are you sure you want to publish %@ files to “%@”?" = "您确定要向“%@”发布 %@ 个文件吗？";
"Publishing will upload the selected files to the same relative location on the server, and will overwrite any existing files." = "发布会将所选文件上传到服务器的同一相对位置，并会覆盖任何现有文件。";

"Clear Selected Items…" = "清除所选项…";
"Clear “%@”…" = "清除“%@”…";

"Add Ignore Rules for Selected Items" = "为所选项添加忽略规则";
"Add Ignore Rule for “%@”" = "为“%@”添加忽略规则";

"Publishing to “%@”…" = "发布到“%@”…";

"Publish Started" = "发布已开始";
"Publish Finished" = "发布已结束";
"Publish Failed" = "发布失败";


// Documents
"Document" = "文稿";

"New Document" = "新文稿";
"Current Document" = "当前文稿";

"untitled" = "未命名";
"Untitled" = "未命名";

"Opening “%@”…" = "正在打开“%@”…";
"Closing “%@”…" = "正在关闭“%@”…";
"Reverting “%@”…" = "正在还原“%@”…";
"Saving “%@”…" = "正在保存“%@”…";
"Downloading “%@”…" = "正在下载“%@”…";
"Uploading “%@”…" = "正在上传“%@”…";

"The document “%@” is closed." = "文稿“%@”已关闭。";

"Save before closing?" = "关闭前保存？";
"Do you want to save the changes you made in the document “%@”?" = "您要保存在文稿“%@”中的更改吗？";
"Save" = "存储";
"Don't Save" = "不保存";
"Save…" = "保存…";

"The document “%@” has been changed by another application since you opened or saved it." = "文稿“%@”在您将其打开或保存后被另一应用程序更改过。";
"The changes made by the other application will be lost if you save. Save anyway?" = "如果存储，其他应用程序所做的更改将会丢失。仍要存储吗？";
"Save Local Copy…" = "保存本地副本…";

"Could not save changes to “%@”: %@" = "无法将更改保存到“%@”： %@";
"Do you want to discard the changes you made in the document “%@” and close it anyway?" = "您仍要放弃在文稿“%@”中的更改并将其关闭吗？";
"Discard Changes" = "放弃更改";

"The document “%@” is currently being saved." = "文稿“%@”目前正在保存。";
"Do you want to wait to close the document once changes are saved?" = "您要等待在更改保存后关闭文稿吗？";
"Close After Saving" = "保存后关闭";
"Don't Close" = "不关闭";

"Review Unsaved Changes?" = "审查未保存的更改？";
"There are multiple documents with unsaved changes. Do you want to review them, or discard all changes?" = "有多个文稿具有未保存的更改。您想对其进行审查还是放弃全部更改？";

"Review All" = "审查全部";
"Discard All" = "放弃全部";

"Revert" = "还原";
"Do you want to revert the document “%@” to the latest saved version?" = "您要将文稿“%@”还原为最新保存的版本吗？";
"Unsaved changes will be discarded." = "未保存的更改将被放弃。";

"Refactor" = "重构";

"Rename…" = "重新命名…";
"Rename" = "重新命名";

"Reformat…" = "重新格式化…";
"Reformat" = "重新格式化";

"Waiting on extensions to finish pre-save actions…" = "等待扩展完成保存前的操作…";
"Waiting on %@ to finish pre-save actions…" = "等待 %@ 完成保存前的操作…";

"Could not open “%@”." = "无法打开“%@”。";
"Could not revert “%@”." = "无法还原“%@”。";
"Could not save “%@”." = "无法存储“%@”。";
"Could not download “%@”." = "无法下载“%@”。";
"Could not upload “%@”." = "无法上传“%@”。";

"The file is in a format or encoding that could not be interpreted." = "该文件的格式或编码无法解释。";
"The document may not exist on disk or you may not have permissions to read it." = "该文稿可能不在磁盘上，或您可能没有读取权限。";
"Could not find a registered document class capable of opening the file." = "找不到能够打开此文件的注册文稿类。";

"The document is not in a state where the operation can be performed safely. Try waiting until other operations are complete or reopen the document." = "文稿当前状态不允许安全地执行该操作。尝试等待其他操作完成或重新打开文稿。";
"The document could not be written with the chosen text encoding." = "无法使用所选文本编码写入文稿。";

"You do not have permission to save the file “%@”. To continue, %@ needs administrator access to invoke a privileged helper tool." = "您无权保存文件“%@”。要继续，%@ 需要管理员访问权限以调用专用助手工具。";

"The text being replaced does not match" = "被替换的文本不匹配";
"The document may have been modified since the edit was performed. Try performing the operation again." = "该文稿可能自执行过编辑后已经更改。请再次尝试执行操作。";


// Indexing
"Indexing Files…" = "正在索引文件…";
"Initializing Index…" = "正在初始化索引…";


// Find & Replace
"Find" = "查找";
"Replace" = "替换";
"Replace All" = "替换全部";

"1 match" = "1 个匹配";
"%@ matches" = "%@ 个匹配";
"%1$@ ⁄ %2$@ matches" = "%1$@⁄%2$@ 个匹配";

"Recent Patterns" = "最近的模式";
"No Recent Patterns" = "无最近的模式";
"Clear Recent Patterns" = "清除最近的模式";

"Queueing…" = "正在加入队列...…";
"Queueing %@ files…" = "正在将 %@ 个文件加入队列...…";
"%1$@ ⁄ %2$@ files" = "%1$@⁄%2$@ 个文件";
"%@ files remaining…" = "剩余 %@ 个文件…";

"Cancel current operation" = "取消当前操作";
"Clear results" = "清除结果";

"%@ results in %@ files." = "%@ 个结果在 %@ 个文件中";
"No Results for “%1$@” in %2$@" = "在 %2$@ 中未找到“%1$@”的结果";

"Regex Invalid" = "常规表达式无效";

"contains" = "包含";
"matches word" = "匹配单词";
"starts with" = "开始是";
"ending with" = "结尾是";
"matches regex" = "匹配正则表达式";
"match case" = "区分大小写";
"ignore case" = "忽略大小写";

"Any Characters" = "任何字符";
"Any" = "任何";
"Word Characters" = "单词字符";
"Word" = "单词";
"Digits" = "数字";
"Whitespace" = "空白";
"Non-ASCII Characters" = "非 ASCII 字符";
"Hexadecimal Digits" = "十六进制数字";

"Tab" = "标签页";
"Word Break" = "断字";
"Line Break" = "换行";

"Wildcards" = "通配符";
"Current Wildcards" = "当前通配符";

"In %@" = "在 ％@ 中"; // As in "In Project", "In 2 Folders", etc.
"%@ Folders" = "%@ 个文件夹";
"Containing Folders" = "包含文件夹";
"Choose Folders…" = "选择文件夹…";

"Filters" = "过滤器";

"1 filter" = "1 个筛选器";
"%@ filters" = "%@ 个筛选器";

"Matching all of:" = "匹配全部：";
"Matching one or more of:" = "匹配一个或多个：";
"No custom filters created." = "未创建自定义筛选器。";

"New Filter" = "新过滤器";

"This filter will be grouped as “%@”." = "该筛选器将被分组为“％@”。";
"matching all" = "匹配全部";
"matching one or more" = "匹配一个或多个";

"Searching open files for this remote project." = "搜索此远程项目的打开文件。";
"Searching open files; open a folder to search project-wide." = "搜索打开的文件；打开一个文件夹以便在整个项目范围内搜索。";

"Are you sure you want to replace all?" = "您确定要替换所有吗？";
"This will replace %@ results in %@ files." = "这将在 %@ 个文件中替换 %@ 个结果。";

"Replace All in Document" = "在文稿中全部替换";

"Could not open file." = "无法打开文件。";
"The document may have been moved or deleted since the search was performed. Try performing the search again." = "文稿可能在执行搜索后已被移动或删除。请再次尝试搜索。";

"Text no longer matches find results." = "文本不再与查找结果匹配。";
"The document may have been modified since the search was performed. Try performing the search again." = "文稿可能在执行搜索后已被修改。请再次尝试搜索。";


// Clips
"Clips" = "剪辑";

"(untitled group)" = "（未命名群组）";
"(untitled clip)" = "（未命名剪辑）";

"Anywhere" = "任何位置";

"Insert Placeholder" = "插入占位符";
"Edit Placeholder" = "编辑占位符";

"Named Placeholder" = "已命名的占位符";

"Date" = "日期";
"Filename" = "filename";
"Parent Folder" = "父文件夹";
"Project Name" = "项目名称";
"Author Name" = "作者姓名";
"Source Control Revision" = "源控制修订";

"Insertion Point" = "插入点";
"Text Selection" = "文本选择";
"Previous Text" = "上个文本";
"Pasteboard Text" = "粘贴板文本";

"Click the + button to add clips." = "点按 + 按钮添加剪辑。";
"More clips can be found in the Extension Library." = "可在扩展库中找到更多剪辑。";
"No matching clips found." = "未找到匹配的剪辑。";


// Issues
"Issues" = "问题";
"Fix" = "修理";
"Apply Fixit" = "应用 Fixit";

"Error" = "错误";
"Warning" = "警告";
"Hint" = "提示";
"Info" = "信息";

"1 issue" = "1 个问题";
"%@ issues" = "%@ 个问题";

"None of your installed extensions are providing live validation for this project." = "您安装的任何扩展均不为此项目提供实时验证。";
"Some extensions may require that files be open to perform validation." = "某些扩展可能需要文件打开，以执行验证。";


// Debug
"Debug" = "调试";
"Debugger" = "调试器";
"Debug Console" = "调试控制台";

"Show Debug Gauges" = "显示调试仪表";
"Hide Debug Gauges" = "隐藏调试仪表";

"CPU" = "CPU";
"Memory" = "内存";
"Disk" = "磁盘";

"Attaching to %@…" = "正在等待附加到 %@…";
"Waiting for connections…" = "正在等待连接…";
"Finished running %@" = "已结束运行 %@";

"Activate Breakpoints" = "激活断点";
"Deactivate Breakpoints" = "停用断点";

"Pause" = "暂停";
"Continue" = "继续";

"Pause execution" = "暂停执行";
"Continue execution" = "继续执行";

"Thread %d" = "线程 %d";
"Line %d" = "行 %d";

"Unnamed Breakpoint" = "未命名的断点";

"Enable Function Breakpoint" = "启用功能断点";
"Function" = "功能";
"Functions" = "功能";
"Example: “myFunctionName”" = "示例：“我的函数名称”";

"One or more active sessions do not support function breakpoints: %@" = "一个或多个活跃会话不支持功能断点：%@";
"One or more active sessions do not support breakpoint conditions: %@" = "一个或多个活跃会话不支持断点条件：%@";
"One or more active sessions do not support exception options: %@" = "一个或多个活跃会话不支持例外选项：%@";

"Exceptions" = "例外";
"Enable Exception Breakpoint" = "启用例外断点";
"Enable Exception Breakpoint for “%@”" = "为“%@”启用例外断点";

"%@ has encountered an exception:" = "%@ 遇到一个例外：";

"Enable Breakpoint in %@:%ld" = "在 %@:%ld 启用断点";

"No debug session is running." = "没有正在运行的调试会话。";
"No variables to display." = "没有要显示的变量。";
"Fetching variables…" = "正在提取变量…";
"Debug session is running." = "调试会话正在运行。";

"Auto" = "自动";

"Printing description of “%@”:" = "正在打印“%@”的描述：";

"Add Breakpoint at Current Line" = "在当前行添加断点";
"Remove Breakpoint at Current Line" = "在当前行移除断点";
"Enable Breakpoint at Current Line" = "在当前行启用断点";
"Disable Breakpoint at Current Line" = "在当前行禁用断点";

"Edit Breakpoint…" = "编辑断点…";

"Enable Breakpoint" = "启用断点";
"Disable Breakpoint" = "禁用断点";
"Delete Breakpoint" = "删除断点";

"Enable Breakpoints" = "启用断点";
"Disable Breakpoints" = "禁用断点";
"Delete Breakpoints" = "删除断点";

"Double-click to edit a breakpoint" = "连按编辑断点";


// Console
"Console" = "控制台";

"All Sources" = "全部来源";


// Reports
"Reports" = "报告";
"Report" = "报告";

"Show Report…" = "显示报告…";
"No Report" = "无报告";


// Terminal
"Terminal" = "终端";

"Local Terminal" = "本地终端";
"Remote Terminal" = "远程终端";

"Local Shell" = "本地 Shell";
"SSH" = "SSH";

"New Local Terminal" = "新本地终端";
"New Remote Terminal" = "新远程终端";
"Quick Connect" = "快速连接";
"Shared SSH Servers" = "共享的 SSH 服务器";

"Meta" = "元";
"Use Option as Meta Key" = "使用 Option 作为元键";
"Clear Scrollback" = "清除回滚";

"Numeric Keypad Clear" = "数字键盘 Clear";
"F1" = "F1";
"F2" = "F2";
"F3" = "F3";
"F4" = "F4";
"F5" = "F5";
"F6" = "F6";
"F7" = "F7";
"F8" = "F8";
"F9" = "F9";
"F10" = "F10";
"F11" = "F11";
"F12" = "F12";
"F13" = "F13";
"F14" = "F14";
"F15" = "F15";
"F16" = "F16";
"F17" = "F17";
"F18" = "F18";
"F19" = "F19";
"← Cursor Left" = "← 左移光标";
"↑ Cursor Up" = "↑ 上移光标";
"→ Cursor Right" = "→ 右移光标";
"↓ Cursor Down" = "↓ 下移光标";
"↖︎ Home" = "↖︎ Home";
"↘︎ End" = "↘︎ End";
"⇞ Page Up" = "⇞ Page Up";
"⇟ Page Down" = "⇟ Page Down";
"⌦ Forward Delete" = "⌦ 向前删除";
"⌫ Delete" = "⌫ 删除";

"⌥ Option" = "⌥ Option";
"⌃ Control" = "⌃ Control";
"⇧ Shift" = "⇧ Shift";
"⌃⌥ Control-Option" = "⌃⌥ Control-Option";
"⌃⌥⇧ Control-Option-Shift" = "⌃⌥⇧ Control-Option-Shift";
"⌥⇧ Option-Shift" = "⌥⇧ Option-Shift";
"⌃⇧ Control-Shift" = "⌃⇧ Control-Shift";

"Send Text" = "发送文本";
"Scroll Page Down" = "向下滚动页面";
"Scroll Page Up" = "向上滚动页面";
"Scroll to Top" = "滚动到顶部";
"Scroll to Bottom" = "滚动到底部";
"Num Lock" = "Num Lock";

"Do you want to terminate the running processes in this terminal?" = "您要终止在此终端运行的进程吗？";
"Closing this tab will terminate the running process %@." = "关闭此标签页将终止运行的进程 %@。";
"Closing this tab will terminate the running remote shell." = "关闭此标签页将终止运行的远程 shell。";

"Send Text" = "发送文本";
"Scroll Page Down" = "向下滚动页面";
"Scroll Page Up" = "向上滚动页面";
"Scroll to Top" = "滚动到顶部";
"Scroll to Bottom" = "滚动到底部";
"Num Lock" = "Num Lock";

"System Default" = "系统默认值";


// Quick Open
"Open Quickly" = "快速打开";
"Type a filename or symbol to quickly open it." = "键入一个文件名或符号以快速打开。";
"Type a filename to quickly open it." = "键入一个文件名以快速打开。";
"Type a symbol to quickly open it." = "键入一个符号以快速打开。";

"Open Quickly from Tabs" = "从标签页中快速打开";
"Type a filename or symbol to quickly open tabs." = "键入一个文件名或符号以快速打开标签页。";


// Commands
"Commands" = "命令";
"Type a command or menu item." = "键入一个命令或菜单项。";


// Text
"Text" = "文本";

"Gutter" = "装订线";

"Symbols" = "符号";
"Symbols in Open Tabs" = "打开标签页中的图标";
"Current symbol: %@" = "当前符号：%@";

"No symbols found in the current document." = "未在当前文稿中找到符号。";
"No text document focused." = "没有聚焦的文本文稿。";

"Go To Symbol" = "前往符号";

"(no symbol)" = "（无符号）";

"Position" = "位置";
"Ln %@, Col %@" = "行 %@，栏 %@";
"Ln %@, Col %@ (%@)" = "行 %@，栏 %@（%@）";
"Position: line %@, column %@" = "位置：行 %@，栏 %@";
"Position: line %@, column %@, %@ selected characters" = "位置：行 %@，栏 %@，%@ 个所选字符";

"Source Control status: %@ additions, %@ removals" = "源控制状态：%@ 个添加，%@ 个移除";

"Go To Line" = "前往行";
"Enter a line number (“12”) or line number and column (“12:30”) to jump to that position." = "输入行号（“12”）或行号和列（“12:30”）以跳到该位置。";

"Indentation" = "缩进";
"Spaces" = "个空格";
"Tabs" = "标签页";
"Tab Width" = "制表符宽度";
"Indent Level %ld" = "缩进级别 %ld";
"1 Space" = "1 个空格";
"%ld Spaces" = "%ld 个空格";
"1 Tab" = "1 个制表符"; // Textual tabs, as in whitespace
"%ld Tabs" = "%ld 个制表符"; // Textual tabs, as in whitespace
"Tabs (%ld sp)" = "制表符（%ld 个空格）"; // Textual tabs, as in whitespace
"Custom…" = "自定义…";
"Autodetect" = "自动检测";

"Indent Selection" = "缩进选择";
"Comment Selection" = "注释选择";

"Comment Selection by Line" = "按行选择注释";
"Comment Selection by Block" = "按块选择注释";

"Indentation Width" = "缩进宽度";
"Enter the number of spaces to use for the indentation width." = "输入用于缩进宽度的空格数。";

"Line Endings" = "行尾";
"Would you like to convert the old line endings in your document?" = "您想转换文稿中的旧行尾吗？";
"Convert" = "转换";
"Just Switch" = "只需切换";

"This file has mixed line endings. Do you want to convert all line endings to %@, the most common line ending in the file?" = "此文件有混合的行尾。您要将所有行尾转换为文件中最普通的行尾 %@ 吗？";
"Other applications may not be able to read the file if you don't convert all line endings to the same type." = "如果不将所有行尾转换为同一类型，其他应用程序可能无法读取该文件。";
"Convert to %@" = "转换为 %@";

"Text Encoding" = "文本编码";

"Do you want to reinterpret this document as “%@”, or just change the encoding?" = "您是否要将该文稿重新解释为“％@”，还是仅更改编码？";
"Reinterpreting will reopen the file using the new encoding, discarding any unsaved changes. Changing the encoding only affects how the file is written when next saved." = "重新解释将使用新编码重新打开文件，并丢弃所有未保存的更改。更改编码只会影响下次保存文件时的写入文件。";
"Reinterpret" = "重新解释";
"Discard Changes & Reinterpret" = "放弃更改并重新解释";
"Change Encoding Only" = "仅更改编码";
"Change Text Encoding" = "更改文本编码";

"The document cannot be changed to the chosen encoding without losing information." = "该文稿无法更改为所选编码而不丢失信息。";
"Characters within the document may not be expressable in the encoding. You may wish to choose a different encoding which supports a wider character set." = "文稿中的字符可能无法用编码表示。您可能希望选择支持更大字符集的不同编码。";
"Change Anyway" = "仍要更改";

"You are trying to insert characters which cannot be handled by the document's current encoding without losing information. Do you want to insert the characters anyway?" = "您正试图插入文稿当前编码在不丢失信息的前提下无法处理的字符。您仍要插入字符吗？";
"If you promote the document to a Unicode encoding you can insert the characters without losing information." = "如果您将文稿提升为 Unicode 编码，则可以在不丢失信息的前提下插入字符。";
"Promote to UTF-16" = "提升为 UTF-16";
"Promote to UTF-8" = "提升为 UTF-8";

"Customize Encodings List…" = "自定义编码列表…";

"No Selection" = "未选择";

"Actions" = "操作";
"Show Code Actions" = "显示代码操作";

"Jump to Definition" = "跳到定义";
"Jump to Declaration" = "跳转到声明";
"Jump to Type Definition" = "跳转到类型定义";
"Jump to Implementations" = "跳转到实现";
"Jump to References" = "跳转到引用";

"Jump to Previous Occurrence" = "跳到上个实例";
"Jump to Next Occurrence" = "跳到下个实例";
"Select All Occurrences" = "选择所有实例";

"Show Quick Help" = "显示快速帮助";

"Find in Project…" = "在项目中查找…";

"No Guesses Found" = "未找到猜测";
"Ignore Spelling" = "忽略拼写";
"Learn Spelling" = "了解拼写";
"Unlearn Spelling" = "取消学习拼写";

"Show Minimap" = "显示小地图";
"Hide Minimap" = "隐藏小地图";

"Show Invisible Characters" = "显示不可见字符";
"Hide Invisible Characters" = "隐藏不可见字符";

"Show Line Numbers" = "显示行号";
"Hide Line Numbers" = "隐藏行号";

"Show Code Folding Ribbon" = "显示代码折叠条";
"Hide Code Folding Ribbon" = "隐藏代码折叠条";

"Show Code Structure Headers" = "显示代码结构标头";
"Hide Code Structure Headers" = "隐藏代码结构标头";

"Show Type and Function Separators" = "显示类型和功能分隔符";
"Hide Type and Function Separators" = "隐藏类型和功能分隔符";

"Automatic Parsing Disabled" = "已禁用自动分析";
"The document “%@” exceeds the parsing file size limit. You can override this, but doing so may impact performance. Enable parsing at any time from the Editor → Syntax menu." = "文稿“%@”超过分析文件大小限制。您可以进行覆盖，但这样做可能影响性能。随时从“编辑器 → 语法”菜单启用分析。";
"Always enable parsing for this file" = "始终为此文件启用分析";
"Enable Parsing" = "启用分析";
"Disable Parsing" = "禁用分析";

"macOS / Unix (LF)" = "macOS / Unix (LF)";
"Mac OS Classic (CR)" = "Mac OS Classic (CR)";
"Windows (CRLF)" = "Windows (CRLF)";

"Syntax Inspector" = "语法检查器";
"Toggle the syntax inspector when hovering over code" = "在代码上悬停时，切换语法检查器";
"Inspecting" = "正在检查";
"%@ chars" = "%@ 个字符";
"Copy S-Expression" = "复制 S-表达式";

"Show Comparison" = "显示比较";
"Hide Comparison" = "隐藏比较";

"Format Document" = "格式化文档";
"Format Selection" = "格式化所选内容";
"Format On Type" = "输入时格式化";


// Printing
"Grayscale" = "灰度";
"Printing Frame" = "打印框架";
"Font" = "字体";
"Letter Spacing" = "字母间距";
"Line Height" = "行高";
"Line Numbers" = "行编号";
"Header and Footer" = "页眉和页脚";
"Full File Path" = "完整文件路径";
"Timestamp" = "时间戳";

"Simple" = "简单";
"Pizza Parlor" = "披萨店";

"Date Last Saved" = "上次保存日期";
"Date Printed" = "打印日期";


// Preview

"Preview" = "预览";
"Preview In" = "预览使用";

"Open Preview in Tab" = "在标签页中打开预览";

"Split Preview Upward" = "向上分离预览";
"Split Preview Downward" = "向下分离预览";
"Split Preview Left" = "向左分离预览";
"Split Preview Right" = "向右分离预览";

"Preview Current Document" = "预览当前文稿";

"Cannot Preview Unsaved Document" = "无法预览未保存的文稿";
"To preview this document in an external application, you must first save it." = "若要在外部应用程序中预览此文稿，必须先保存。";

"Cannot Preview Document" = "无法预览文稿";
"The application with the bundle identifier “%@” could not be found." = "找不到捆绑包标识符为“％@”的应用程序。";
"The default application for previewing URL “%@” could not be found." = "找不到用于预览 URL“%@”的默认应用程序。";

"Reload" = "重新加载";

"Lock Focus to “%@”" = "锁定焦点到“%@”";
"No previewable documents." = "无可预览文稿";

"Stylesheets" = "样式表";
"Scripts" = "脚本";
"No linked files could be found in the project." = "无法在项目中找到关联的文件";

"Show Web Inspector" = "显示网页检查器";
"Hide Web Inspector" = "隐藏网页检查器";

"%@ can't open the specified address." = "%@ 无法打开指定地址。";

"Show certificate" = "显示证书";
"Connection is not secured with TLS." = "连接未使用 TLS 加密。";

"Allow “%@” to use your camera?" = "允许“%@”使用您的相机？"; // %@ is a URL domain
"Allow “%@” to use your microphone?" = "允许“%@”使用您的麦克风？"; // %@ is a URL domain
"Allow “%@” to use your camera and microphone?" = "允许“%@”使用您的相机和麦克风？"; // %@ is a URL domain

"Allow" = "允许";
"Don't Allow" = "不允许";

"Web process terminated unexpectedly." = "网络进程意外终止。";
"Reload the page to attempt to restart it." = "刷新页面尝试重启动。";

"JavaScript alert from “%@”." = "来自“%@”的 JavaScript 提示。";

"Preview Server is running on port %d" = "预览服务器正在端口 %d 运行";
"Preview Server is not running" = "预览服务器未在运行";
"Start Preview Server" = "启动预览服务器";
"Stop Preview Server" = "停止预览服务器";
"Copy Preview Server URL" = "拷贝预览服务器 URL";

"AirPreview" = "AirPreview";


// Pops

"Color" = "颜色";
"Color Picker" = "颜色选择器";

"COLOR_FORMAT_rgb" = "RGB";
"COLOR_FORMAT_hsl" = "HSL";
"COLOR_FORMAT_hsb" = "HSV";
"COLOR_FORMAT_p3" = "Display P3";
"COLOR_FORMAT_hex" = "十六进制";
"COLOR_FORMAT_named" = "已命名";

"sRGB" = "sRGB"; // The sRGB color space
"Display P3" = "Display P3"; // The Display P3 color space
"P3" = "P3"; // Shorthand for the Display P3 color space

"No Swatch Lists" = "无色板列表";

"New Swatch List…" = "新色板列表…";
"Duplicate…" = "复制…";
"Rename…" = "重新命名…";
"Remove…" = "移除…";

"Import…" = "导入…";
"Export…" = "导出…";

"Global" = "全局";

"Move List to Project" = "将列表移到项目";
"Move List to Global" = "将列表移到全局";

"The selected color space may not be fully representable on this screen. Colors may not appear accurate if they are outside of the gamut of your display device." = "所选色彩空间可能无法在此屏幕上完全表示。如颜色超出显示设备的色域，则颜色看起来或许不准确。";


// Vim
"Vim" = "Vim";

"vim-normal" = "正常";
"vim-insert" = "插入";
"vim-visual" = "视觉";
"vim-visual-line" = "视觉行";
"vim-visual-block" = "视觉块";
"vim-command" = "Command";
"vim-search" = "搜索";
"vim-filter" = "筛选器";

// Vim Operators
"vim-change" = "更改";
"vim-delete" = "删除";
"vim-yank" = "拷贝";
"vim-reindent" = "缩进";
"vim-replace" = "替换字符";
"vim-shiftLeft" = "减少缩进";
"vim-shiftRight" = "缩进";
"vim-swapCase" = "转换大小写";
"vim-lowercase" = "小写";
"vim-uppercase" = "大写";
"vim-register" = "使用寄存器";
"vim-insertRegister" = "插入寄存器";
"vim-insertDigraph" = "插入合成符";
"vim-insertLiteral" = "插入文字数值";

// Vim Modifiers
"vim-modifier-around" = "围绕";
"vim-modifier-inside" = "内部";
"vim-modifier-previous" = "上次出现：";
"vim-modifier-next" = "下次出现：";
"vim-modifier-afterPrevious" = "在该字符上次出现后：";
"vim-modifier-beforeNext" = "在该字符出现前：";

// Vim Display Name Formats
"vim-nameFormat-register" = "使用寄存器 %1$@…"; // RegisterName: e.g. "Using register f…"
"vim-nameFormat-register-action" = "使用寄存器 %1$@：%2$@"; // RegisterName/Action: e.g. "Using register f: Yank…"

"vim-nameFormat-operator-count-modifier" = "%1$@ %2$@ %3$@…"; // Operator/Count/Modifier, e.g. "Yank 20x around…"
"vim-nameFormat-operator-count" = "%1$@ %2$@…"; // Operator/Count, e.g. "Yank 20x…"
"vim-nameFormat-modifier-count" = "%1$@ %2$@…"; // Modifier/Count, e.g. "Around 20x…"
"vim-nameFormat-operator-modifier" = "%1$@ %2$@…"; // Operator/Modifier, e.g. "Yank around…"
"vim-nameFormat-operator" = "%1$@…"; // Operator, e.g. "Yank…"
"vim-nameFormat-modifier" = "%1$@…"; // Modifier, e.g. "Around…"
"vim-nameFormat-count" = "%1$@…"; // Count, e.g. "20x…"

// Vim Commands
"Enter an Ex command" = "输入 Ex 命令";


// Images and Media

"Image" = "图像";
"Audio" = "音频";
"Video" = "视频";
"Media" = "文件";
"PDF" = "PDF";

"Transparent" = "透明";
"Light Transparent" = "浅色透明";
"Dark Transparent" = "深色透明";
"Theme" = "主题";
"Black" = "黑色";
"White" = "白色";
"Gray" = "灰色";

"Play" = "完成后播放";
"Pause" = "暂停";

"Speed" = "速度";
"Matte" = "哑光";
"Zoom" = "缩放";

"Could not read the image data." = "无法读取图像数据。";


// Operations
"Ready" = "就绪";

"Connecting" = "正在连接";
"Downloading" = "正在下载";
"Uploading" = "正在上传";
"Moving" = "正在移动";
"Copying" = "正在拷贝";
"Deleting" = "正在删除";
"Listing" = "正在列出";
"Renaming" = "正在重新命名";
"Creating File" = "创建文件";
"Creating Folder" = "创建文件夹";
"Archiving" = "正在归档";
"Unarchiving" = "取消存档";
"Changing Attributes" = "正在更改属性";
"Changing Directory" = "更改目录";
"Calculating Size" = "正在计算大小";
"Transferring" = "正在传输";

"Download Selected Items" = "下载所选项";
"Download Selected Items to “%@”" = "下载所选项到“%@”";
"Download “%@” to “%@”" = "下载“%@”到“%@”";

"Upload Selected Items" = "上传所选项";
"Upload Selected Items to “%@”" = "上传所选项到“%@”";
"Upload “%@” to “%@”" = "上传“%@”到“%@”";

"Could not connect to “%@”." = "无法连接到服务器“%@”。";
"No additional information about the error was provided. (Error code %d)" = "未提供有关此错误的更多信息。（错误代码 %d）";


// Source Control
"Source Control" = "源控制";
"Git" = "Git";
"Repository" = "存储库";

"Git Accounts" = "Git 帐户";

"You" = "您";
"(uncommitted)" = "（未提交）";

"Clone via URL" = "通过 URL 克隆";

"Changes" = "更改";
"History" = "历史记录";
"Branches" = "分支";
"Tags" = "标记";
"Remotes" = "远程";
"Submodules" = "子模块";

"Show Last Change for Line" = "显示行的上次更改";
"Show Last Change for Line Ignoring Whitespace" = "显示上次对行忽略空白进行的更改";

"No Commits" = "无提交";

"Create New Local Branch" = "创建新本地分支";
"Creates a new local branch from the remote branch “%@”." = "从远程分支“%@”创建一个新本地分支。";
"Track Branch “%@”" = "跟踪分支“%@”";
"Create Branch" = "创建分支";

"Create Branch from “%@”…" = "从“%@”创建分支…";
"Create New Branch" = "创建新分支";
"Creates a new local branch from “%@”." = "从“%@”创建一个新本地分支。";
"Checkout New Branch" = "签出新分支";

"Publish Branch" = "发布分支";
"Creates a new remote branch on the selected remote." = "在所选的远程上创建一个新远程分支。";
"Local Branch:" = "本地分支：";
"Remote:" = "远程：";
"Track New Remote Branch" = "跟踪新的远程分支";
"Publish Branch" = "发布分支";

"Create Tag from “%@”…" = "从“%@”创建标签…";
"Create New Tag" = "创建新标签";
"Creates a new annotated tag from “%@”." = "从“%@”创建一个新批注标签。";
"Create Tag" = "创建标签";
"Message:" = "信息:";

"Commit" = "提交";

"%@ (detached)" = "%@（游离）";

"Commit to Detached HEAD" = "提交到游离 HEAD";
"You are currently working on a detached HEAD, which will not point to any branch. Commits made in this state will not appear in your commit history.\n\nIf this is not what you want, check out a branch before committing." = "您当前正在处理的游离 HEAD 将不会指向任何分支。在此状态下进行的提交将不会出现在您的提交历史记录中。\n\n如果您不希望这样，请在提交前签出分支。";

"Are you sure you want to checkout “%@”?" = "您确定要检出“%@”吗？";
"The repository will be placed in a detached HEAD state." = "存储库将处于分离的 HEAD 状态。";

"Are you sure you want to cherry-pick “%@” onto “%@”?" = "您确定要将“%@”向“%@”摘樱桃吗？";
"The contents of this commit will be integrated into the current branch." = "此提交的内容将集成到当前分支中。";
"Cherry-Pick" = "摘樱桃";

"Remotes" = "远程"; // Where "Remote" is a Git repository remote URL
"Add Remote" = "添加远程"; // Where "Remote" is a Git repository remote URL
"Enter the name and URL of the remote to add for this repository." = "输入要为此存储库添加的远程的名称和 URL。";
"URL:" = "URL：";

"Checkout Revision…" = "Checkout 修订…";
"Checkout Revision" = "Checkout 修订";
"Enter the revision, branch, tag, or reference you want to check out. Your local HEAD pointer will then be moved." = "输入要检查的修订、分支、标记或引用。然后您的本地 HEAD 指针将被移动。";
"Revision:" = "修订：";

"Current Version" = "当前版本";
"Uncommitted Changes" = "未提交的更改";
"Latest Commit" = "最新提交";
"Compared File" = "比较的文件";
"Compared Data" = "比较的数据";
"Compared Text" = "比较的文本";

"Your Stuff" = "您的副本";
"Their Stuff" = "他们的副本";

"Loading comparison…" = "正在加载比较…";
"To compare against a file of your choice, click “Choose…” or drag it into this pane." = "要比较您选择的文件，请点击“选择…”或将其拖动到此窗格中。";
"This file is not under source control." = "此文件不在源控制之下。";
"This file has not yet been committed." = "此文件尚未提交。";
"Could not find this file in the commit's tree." = "在提交的树上找不到此文件。";

"Choose a file for comparison…" = "选择要比较的文件…";
"Compare" = "比较";

"Previous Change" = "上一个更改";
"Next Change" = "下一个更改";

"No changes" = "无更改";
"1 change" = "1 处更改";
"%@ changes" = "%@ 次更改";

"Ignore Whitespace" = "忽略空白";

"Checkout" = "Checkout";
"Fetch" = "取得";
"Fetch from “%@”" = "从“%@”取得";
"Pull" = "拉取";
"Pull from “%@”" = "从“%@”拉取";
"Push" = "推送";
"Push…" = "推送…";
"Push to “%@”" = "推送到“%@”";

"Checkout “%@”" = "签出“%@”";
"Fast-forward to “%@”" = "快进到“%@”";
"Pull “%@”" = "拉取“%@”";
"Pull “%1$@” into “%2$@”" = "将“%1$@”拉取到“%2$@”";
"Push “%1$@” to “%2$@”" = "将“%1$@”推送到“%2$@”";
"Push “%@” to" = "将“%@”推送到";
"Merge into “%@”…" = "合并到“%@”中…";

"Switch to “%@”…" = "切换到“%@”…";
"Update “%@”…" = "更新“%@”…";
"Move “%@”…" = "移动“%@”…";
"Rename “%@”…" = "重命名“%@”…";
"Delete “%@”…" = "删除“%@”…";

"Create New Branch from “%@”…" = "从“%@”创建新分支…";
"Create New Tag from “%@”…" = "从“%@”创建新标签…";
"Copy Branch Name" = "复制分支名称";
"Copy Tag Name" = "复制标签名称";

"Fetch “%@”…" = "获取“%@”…";
"Prune Obsolete Remote Branches" = "修剪过时的远程分支";
"Push All Tags to “%@”" = "将所有标签页推送到“%@”";

"Rename Branch" = "重命名分支";
"Enter a new name for this branch." = "为此分支输入新名称。";

"Rename Remote" = "重命名远程";
"Enter a new name for this remote." = "为此远程输入新名称。";

"Amend" = "修改";
"Amend %@" = "修改 %@";

"Discard Change" = "放弃更改";

"Discard Changes in %@ Items…" = "放弃在 %@ 个项中的更改…";
"Discard Changes in “%@”…" = "放弃“%@”中的更改…";
"Discard Changes in Selected Files…" = "放弃在所选文件中的更改…";

"Are you sure you want to discard uncommitted changes in “%@”?" = "确实要放弃对“%@”的未提交更改吗？"; // Single File
"Are you sure you want to discard uncommitted changes in %@ files?" = "确实要放弃对 %@ 个文件的未提交更改吗？"; // Multiple files
"Discard" = "放弃";

"Item is untracked in the working tree" = "项在工作树中未跟踪";
"Item is added in the working tree" = "项已添加到工作树中";
"Item is new in the index" = "项在索引中是新的";
"Item is modified in the working tree" = "项在工作树中被修改";
"Item is modified in the index" = "项在索引中被修改";
"Item is deleted in the working tree" = "项在工作树中被删除";
"Item is deleted in the index" = "项在索引中被删除";
"Item is renamed in the working tree" = "项在工作树中被重新命名";
"Item is renamed in the index" = "项在索引中被重新命名";
"Item is type changed in the working tree" = "项在工作树中被更改了类型";
"Item is type changed in the index" = "项在索引中被更改了类型";
"Item is unreadable by source control" = "源控制无法读取项";
"Item is in conflict in the working tree" = "项在工作树中有冲突";
"Item is ignored in the working tree" = "项在工作树中被忽略";

"%1$@ behind, %2$@ ahead of “%3$@”" = "%1$@ 个晚于、%2$@ 个早于“%3$@”";
"%1$@ behind “%2$@”" = "%1$@ 个晚于“%2$@”";
"%1$@ ahead of “%2$@”" = "%1$@ 个早于“%2$@”";

"Stage" = "暂存";
"Stage All" = "暂存全部";
"Unstage" = "取消暂存";
"Unstage All" = "取消暂存全部";

"Stage Change" = "暂存更改";

"Stage %@ Items" = "暂存 %@ 个项";
"Stage “%@”" = "暂存“%@”";
"Stage Selected Files" = "暂存所选文件";

"Unstage %@ Items" = "取消暂存 %@ 个项";
"Unstage “%@”" = "取消暂存“%@”";
"Unstage Selected Files" = "取消暂存所选文件";

"Message (press ⌘⏎ to commit)" = "信息（按下 ⌘⏎ 提交）";

"Merging" = "正在合并";

"Resolve all conflicts to complete this merge." = "解决所有冲突，以完成此合并。";
"Review the commit message and use “Commit” to complete this merge." = "审查提交消息并使用“提交”完成此合并。";

"Abort Merge" = "中止合并";
"Are you sure you want to abort the current merge?" = "您确定要中止当前的合并吗？";

"Rebasing" = "正在变基";

"Resolve all conflicts to complete this rebase." = "解决所有冲突，以完成此变基。";
"Review the commit message and use “Commit” to complete this rebase." = "审查提交消息并使用“提交”完成此变基。";

"Abort Rebase" = "中止变基";
"Are you sure you want to abort the current rebase?" = "您确定要中止当前的变基吗？";

"Cherry-Picking" = "正在优选";

"Resolve all conflicts to complete this cherry-pick." = "解决所有冲突，以完成此优选。";
"Review the commit message and use “Commit” to complete this cherry-pick." = "审查提交消息并使用“提交”完成此优选。";

"Abort Cherry-Pick" = "中止摘樱桃";
"Are you sure you want to abort the current cherry-pick?" = "您确定要中止当前的摘樱桃吗？";

"Reverting" = "正在还原";

"Resolve all conflicts to complete this revert." = "解决所有冲突，以完成此还原。";
"Review the commit message and use “Commit” to complete this revert." = "审查提交消息并使用“提交”完成此还原。";

"Abort Revert" = "中止还原";
"Are you sure you want to abort the current revert?" = "您确定要中止当前还原吗？";

"Applying Mailbox" = "正在应用邮箱";

"Resolve all conflicts to complete this apply." = "解决所有冲突，以完成此应用。";
"Review the commit message and use “Commit” to complete this apply." = "审查提交消息并使用“提交”完成此应用。";

"Abort Applying" = "中止应用";
"Are you sure you want to abort the current apply?" = "您确定要中止当前应用吗？";

"The operation will be cancelled and any changes so far will be reverted to the previous state before the operation began." = "操作将被取消，截至目前的所有更改均将还原到操作开始前的状态。";

"This repository has no commits." = "此存储库不包含提交。";
"Create one or more commits before pushing to a remote." = "推送到远程前创建一个或多个提交";

"Initialize Empty Repository…" = "初始化空白存储库…";
"Are you sure you want to initialize this project as a new Git repository?" = "您确定要将此项目初始化为新的 Git 存储库？";
"The repository will be created at the root of this project's directory." = "存储库在此项目的根目录中创建。";
"Initialize" = "初始化";

"Delete Branch" = "删除分支";
"Are you sure you want to delete the branch “%@”?" = "您确定要删除分支“%@”吗？";

"Delete Remote Branch" = "删除远程分支";
"Are you sure you want to delete the branch “%1$@” from the remote “%2$@”?" = "您确定要从远程“%2$@”中删除分支“%1$@”吗？";

"Delete Remote" = "删除远程";
"Are you sure you want to delete the remote “%@”?" = "您确定要删除远程“%@”吗？";

"Delete Tag" = "删除标签";
"Are you sure you want to delete the tag “%@”?" = "您确定要删除标签“%@”吗？";

"No Branches Found" = "未找到分支";
"Select Destination…" = "选择目标…";

"Initializing submodules…" = "正在初始化子模块…";
"Initializing submodule: %@" = "正在初始化子模块：%@";
"Stopping…" = "正在停止…";
"The submodule “%@” could not be initialized." = "子模块“%@”无法被初始化。";
"Some submodules could not be initialized:" = "某些子模块无法被初始化：";
"Challenge from %@" = "挑战来自 %@";
"Please enter the passphrase for %@." = "请输入 %@ 的密码短语。";

"No Git repository found." = "未找到 Git 存储库。";
"Initialize…" = "初始化…";

"No branches or tags found." = "找不到分支或标签。";
"No commits found." = "找不到提交。";

"Source Control is not enabled." = "源控制未启用。";
"Enable Source Control" = "启用源控制";

"This repository is being rebased." = "该存储库正在被变基。";
"This repository is being bisected." = "该存储库正在被分为两部分。";
"This repository is in an unknown state." = "此存储库处于一个位置状态。";
"This must be resolved outside of %@." = "必须在 %@ 外解决此问题。";

"Failed to fast-forward branch." = "无法快进分支。";

"Submodule has been added" = "子模块已添加";
"Submodule has been modified" = "子模块已修改";
"Submodule has been deleted" = "子模块已删除";
"Submodule contains uncommitted changes in its index or working directory" = "子模块的索引或工作目录中包含未提交的更改";
"Submodule contains untracked files in its working directory" = "子模块的工作目录中包含未跟踪的文件";
"Submodule is uninitialized in the working directory" = "子模块在工作目录中未初始化";

"Sign in to your %@ account" = "登录您的 %@ 帐户"; // Where %@ is the service name, e.g. "GitHub"
"Validating…" = "正在验证…";
"Authorizing…" = "授权中…";

"Fetching Repositories…" = "正在取得存储库…";
"Error fetching repositories: %@" = "取得存储库时出错： %@";
"Open Accounts Preferences…" = "打开帐户偏好设置…";


// Notifications
"Notifications" = "通知";


// Extensions
"Extension Library" = "扩展库";
"Home" = "主页";

"Create New Extension" = "创建新扩展";
"Choose a location to save your new extension." = "选择保存新扩展的位置。";
"Choose the type of extension:" = "选择扩展类型：";

"Extension Error" = "扩展错误";
"The extension “%@” encountered an error the last time %@ was open. Do you want to disable it? You can enable it again in the Extensions preferences." = "扩展“%@”在上次打开 %@ 时遇到错误。您要将其禁用吗？您可以在“扩展”首选项中再次启用。";
"One or more extensions encountered an error the last time %@ was open. Do you want to disable them? You can enable each one again in the Extensions preferences." = "一个或多个扩展在上次打开 %@ 时遇到错误。您要将其禁用吗？您可以在“扩展”首选项中再次逐个启用。";
"Keep Enabled" = "保持启用";
"Disable" = "禁用";

"%@ issues may be reported at " = "%@ 个问题可以报告于 ";

"Not available." = "不可用。";
"This extension version is unavailable because it requires Nova %@ or later." = "此扩展版本不可用，因为需要 Nova %@ 或更新版本。";
"This extension version is unavailable because it requires Nova %@ or earlier." = "此扩展版本不可用，因为需要 Nova %@ 或更早版本。";
"This extension version is unavailable because it has been disabled by the Panic team." = "此扩展版本不可用，因为已被 Panic 团队禁用。";

"by %@" = "%@ 出品"; // Author, as in "by User Name"
"Version %@" = "版本 %@"; // Version string, as in "Version 1.0"
"v%@" = "v%@"; // Version string, as in "v1.0"
"%@ ago" = "%@ 前"; // As in "1 day ago"
"(no description)" = "（无描述）";

"Back / Forward" = "返回/向前";
"Search for New Extensions" = "搜索新扩展";

"Go to the previous page" = "前往上个页面";
"Go to the next page" = "前往下个页面";
"Go to the homepage" = "前往主页";

"Development Extensions" = "开发扩展";
"Installed Extensions" = "安装的扩展";
"Built-In Packages" = "内建包";

"Install" = "安装";
"Uninstall" = "卸载";
"Deactivate" = "停用";
"Update" = "更新";
"Update All" = "更新全部";
"Not Installed" = "未安装";
"Enable" = "启用";
"Disable" = "禁用";

"Copy Link" = "拷贝链接";

"Extension Not Installed" = "扩展未安装";
"Show in Extension Library…" = "在扩展库中显示…";
"Check For Updates…" = "检查更新…";
"Check for extension updates" = "检查扩展更新";
"Version %@ available, you have version %@." = "版本 %@ 可用，您有版本 %@。";

"Results for “%@”" = "“%@”的结果";
"No Results for “%@”" = "“%@”无结果";

"Featured" = "专题";
"Most Popular: %@" = "最受欢迎：%@";
"All" = "全部";
"All Time" = "全时";
"This Week" = "本周";
"This Month" = "本月";
"Recently Added" = "最近添加";
"Recently Updated" = "最近更新";

"1 Install" = "1 个安装"; // Number of downloads / installations, singular
"%@ Installs" = "%@ Installs"; // Number of downloads / installations, such as "12 Installs"

"No extensions installed." = "没有安装扩展。";
"Discover new extensions using the search field above." = "使用上面的搜索字段探索新扩展。";

"Fetching Extension Details…" = "Fetching Extension Details…";

"Extension Not Found" = "扩展未找到";
"An extension matching “%@” could not be found in the Extension Library." = "在扩展库中找不到与“%@”匹配的扩展。";

"Uninstall “%@”?" = "卸载“%@”？";
"The extension and its functionality will be disabled and removed. Any windows using the extension will be reconfigured accordingly." = "扩展及其功能将被禁用和移除。任何使用扩展的窗口均将被相应重新配置。";

"Do you want to install the extension “%@”, or open it for editing?" = "您要安装“%@”扩展或将其打开进行编辑吗？";
"Do you want to install %@ extensions, or open them for editing?" = "您要安装 %@ 扩展或将其打开进行编辑吗？";
"Installing an extension will load it and enable its features. Opening it for editing will create a new project window for the extension's contents." = "安装扩展将加载并启用其功能。打开进行编辑将为扩展内容创建一个新的项目窗口。";
"Open for Editing" = "打开编辑";

"Extension Service Quit Unexpectedly" = "扩展服务意外退出";
"An issue with one or more extensions caused the service to terminate. As a result, all extensions will need to reload." = "一个或多个扩展的问题导致服务终止。因此，需要重新加载所有扩展。";
"You may optionally disable extensions until the next application launch." = "您还可以选择禁用扩展至下次启动应用程序。";
"The following extensions were executing when the crash occurred:" = "以下扩展在崩溃发生时没有执行：";
"Disable Until Relaunch" = "禁用至重新启动";

"The extension “%@” has stopped responding." = "扩展“%@”已停止响应。";
"You can attempt to interrupt this extension or wait for it completes its work. You can also choose to disable this extension in this workspace until the next time it's opened." = "您可以尝试终止此扩展，或等待其完成工作。您还可以选择在此工作区禁用此扩展直至下次将其打开。";
"Wait" = "等待";
"Interrupt" = "中断";
"Interrupt & Disable" = "中断和禁用";

"Extension Reloaded" = "扩展已重新加载";
"The extension “%@” was reloaded due to a file change." = "由于一个文件更改，扩展“%@”已重新加载。";

"Extension Failed to Reload" = "扩展重新加载失败";
"The extension “%@” could not be reloaded because of one or more issues." = "由于一或多个问题，扩展“%@”无法被加载。";

"Another extension with the identifier “%@” is already loaded." = "已加载标识符为“%@”的扩展。";
"Try disabling or removing the existing extension." = "尝试禁用或移除现有扩展。";

"Extension “%@” Not Installed" = "扩展“%@”未安装";

"Extension Console" = "扩展控制台";

"Configure Themes…" = "配置主题…";

"Reporting abuse for %@ (%@)" = "报告 %@ (%@) 的滥用";
"Please describe the reason that this extension should be reviewed:" = "请说明审核此扩展的原因：";

"Choose the folder containing a Tree-sitter grammar." = "选择包含 Tree-sitter 语法的文件夹。";


// Extension Authoring
"Sign In" = "登录";
"Sign Out" = "注销";

"EXTENSION_ACCOUNT_SIGNUP_URL" = "https://extensions.panic.com/users/signup/";
"EXTENSION_ACCOUNT_PASSWORD_RECOVERY_URL" = "https://extensions.panic.com/password_reset/";

"Not signed in" = "未登录";

"Sign in with your Nova developer account to submit to the extension library." = "用您的 Nova 开发人员帐户登录，以向扩展库提交。";

"Two-Factor Authentication" = "双重认证";
"Your account is protected by two-factor authentication. Enter the code generated by your authorization app." = "您的帐户受双重认证保护。输入由您的授权 App 生成的代码。";

"No Organizations Found" = "未找到组织";
"Register New Organization…" = "注册新组织…";

"Verify Extension for Submission" = "为提交验证扩展";
"Let's validate the contents of your extension before submission." = "在提交之前，我们来验证一下扩展的内容。";

"Ready to Submit Extension" = "为提交扩展就绪";
"Your extension has been validated and is ready to submit." = "您的扩展已经验证，可以提交了。";

"Submitting to the Extension Library" = "正在提交到扩展库";
"Your extension is being packaged and delivered to the library." = "您的扩展正在打包，并交付到库中。";

"No issues found." = "未找到问题。";
"Requesting status from the Extension Library…" = "从“扩展库”请求状态…";

"Packaging extension…" = "扩展打包…";
"Uploading extension…" = "正在上传扩展…";

"Submit" = "提交";

"Your extension was successfully submitted!" = "您的扩展已经成功提交！";


// Updates
"%@ is up to date." = "%@ 是最新的。";
"Check for Updates" = "检查更新";
"Check for Updates…" = "检查更新…";
"Checking for Updates…" = "正在检查更新…";
"The updater encountered an error." = "更新程序遇到错误。";
"Downloading Update…" = "正在下载更新…";
"Install Update" = "安装更新";
"Install Update…" = "安装更新…";
"Installing Update…" = "正在安装更新…";

"A new beta is available." = "新测试版现已推出。";
"A new update is available." = "有新更新。";
"Update Ready!" = "更新就绪！";

"Install & Restart" = "安全并重启";
"Buy Now" = "立即购买";
"Renew Now" = "现在续费";
"Don't notify me of these updates." = "不要通知我这些更新。";
"Opt-out of beta updates." = "退出测试版更新。";

"Learn More." = "了解更多。";
"More Info…" = "更多信息…";

"%1$@ %2$@ is available!" = "%1$@ %2$@ 可用！";
"A new version of %@ is available!" = "有新版本的 %@ 可用！";
"%1$@ %2$@ is now available — you have %3$@.\nThis update will be installed automatically when you quit %1$@." = "%1$@ %2$@ 现在可用 — 您有 %3$@。\n此更新将在您退出 %1$@ 时自动安装。";
"%1$@ %2$@ is now available — you have %3$@, but your year of free updates ended on %4$@. To continue getting updates, buy the latest version of %1$@ and you'll get another year of fixes and new features." = "%1$@ %2$@ 现在可用 — 您有 %3$@，但您的免费更新年度已结束于 %4$@。要继续获得更新，购买最新版本的 %1$@，您将获得另一年的修复和新功能。";

"%1$@ %2$@ is available for testing!" = "%1$@ %2$@ 现已开放测试！";
"A new beta of %@ is available for testing!" = "%@ 的新测试版现已开放测试！";
"%1$@ %2$@ is now available — you have %3$@.\nSince you are not currently using a beta version,\nthis won't be installed automatically." = "%1$@ %2$@ 现已推出 — 您当前的版本为 %3$@。\n由于您目前没有使用测试版本，\n此更新不会自动安装。";

"Release Notes" = "发行说明";
"Release Notes: %@" = "发行说明：%@";


// Problem Reporter
"Problem Report" = "问题报告";
"Report a bug or other issue with Nova." = "报告 Nova 的错误或其他问题。";

"Feature Request" = "功能请求";
"Provide feedback for a new feature or enhancement to Nova." = "向 Nova 提供新功能或增强功能的反馈。";

"Provide feedback for this extension in its issue tracker." = "在问题跟踪器中对此扩展提供反馈。";


// Servers
"ProtocolDescriptionSFTP" = "SSH / SFTP";
"ProtocolDescriptionFTPTLS" = "使用 TLS/SSL 的 FTP";
"ProtocolDescriptionFTPSSL" = "使用隐式 SSL 的 FTP";
"ProtocolDescriptionFTP" = "FTP";
"ProtocolDescriptionAmazonS3" = "Amazon S3";
"ProtocolDescriptionAmazonS3IAM" = "具备 IAM 角色的亚马逊 S3";
"ProtocolDescriptionOneDrive" = "Microsoft OneDrive";
"ProtocolDescriptionOneDriveForBusiness" = "企业版 Microsoft OneDrive";
"ProtocolDescriptionAzure" = "Microsoft Azure";
"ProtocolDescriptionDreamObjects" = "DreamObjects";
"ProtocolDescriptionDropbox" = "Dropbox";
"ProtocolDescriptionGoogleDrive" = "Google Drive";
"ProtocolDescriptionBox" = "Box";
"ProtocolDescriptionRackspace" = "Rackspace Cloud Files";
"ProtocolDescriptionOpenStack" = "OpenStack Swift";
"ProtocolDescriptionWebDAVS" = "WebDAV HTTPS";
"ProtocolDescriptionWebDAV" = "WebDAV";
"ProtocolDescriptionBackblazeB2" = "Backblaze B2";

"server.com" = "server.com";

"objects-us-east-1.dream.io" = "objects-us-east-1.dream.io";
"onedrive.com" = "onedrive.com";
"sharepoint.com" = "sharepoint.com";
"dropbox.com" = "dropbox.com";
"drive.google.com" = "drive.google.com";
"box.com" = "box.com";
"office365.com" = "office365.com";
"microsoft.azure.com" = "microsoft.azure.com";
"identity.api.rackspacecloud.com" = "identity.api.rackspacecloud.com";
"api.backblazeb2.com" = "api.backblazeb2.com";
"s3.amazonaws.com" = "s3.amazonaws.com";
"sts.amazonaws.com" = "sts.amazonaws.com";

"New Server Group" = "新服务器群组";

"Untitled Server" = "未命名服务器";

"Export Encrypted Servers" = "导出加密的服务器";
"Enter a passphrase to use to encrypt the exported servers. This passphrase will be required when importing the servers." = "输入用于加密导出服务器的密码短语。导入服务器时需要此密码短语。";

"Import Encrypted Servers" = "导入加密的服务器";
"Enter the passphrase used to encrypt the exported servers." = "输入用于加密导出服务器的密码短语。";
"The passphrase entered did not match the encrypted data. Enter the passphrase used to encrypt the exported servers." = "输入的密码短语与加密的数据不匹配。输入用于加密导出服务器的密码短语。";

"Export Servers…" = "导出服务器…";
"Export Selected Servers…" = "导出所选的服务器…";

"Add New Server" = "添加新服务器";
"Manage Servers…" = "管理服务器…";

"Connecting…" = "正在连接…";
"Connect via %@" = "通过 %@ 连接";

"Enter a name for the server and choose where to keep it." = "为服务器输入名称并选取存放位置。";

"copy a server password to the pasteboard" = "将服务器密码复制到剪贴板"; // Intentionally not capitalized for formatting by LAContext

"Closest Geographical Endpoint" = "最近的地理终点";


// Panic Sync
"Your servers and keys can automatically sync between Nova, Transmit, and Coda. It's free, secure, and easy." = "您的服务器和密钥可自动在 Nova、Transmit 和 Coda 间同步。同步免费、安全且简单。";


// Transfers
"Transfers" = "传输";

"Source Control Files (Example)" = "源控制文件（示例）";


// Keys

"Select the key files to import." = "选择要导入的密钥文件。";
"Could not import SSH key file “%@”." = "无法导入 SSH 密钥文件“%@”。";
"The file is not in a supported format." = "该文件不是受支持的格式。";

"Would you like to save the passphrase for “%@” in Keychain?" = "您想将“%@”的密码短语存储在钥匙串中吗？";
"A passphrase is required for this encrypted key." = "此加密密钥需要密码。";

"Would you like to copy the key to the Clipboard?" = "您想将密钥拷贝到剪贴板吗？";
"The selected part of the key will be put on the Clipboard." = "密钥的选定部分将被放置在剪贴板上。";
"Copy Public Key" = "拷贝公用密钥";
"Copy Private Key" = "拷贝专用密钥";

"New Key" = "新密钥";
"Automatic" = "自动";

"No Keys" = "无密钥";
"Manage Keys…" = "管理密钥…";

"SSH_KEYS_HELP_URL" = "https://library.panic.com/general/ssh-keys/";


// Key Bindings
"Key Bindings" = "按键绑定";

"Manage Key Bindings…" = "管理按键绑定…";
"New Set from Template" = "从模板新建集合";

"%@ (customized)" = "%@（自定义）";

"%@ is bound to %@" = "%@ 被绑定到 %@";

"Customized" = "自定义";
"Conflicts" = "冲突";

"%@ Menu" = "%@ 菜单";
"Extensions Menu for %@" = "%@ 扩展菜单";
"Editor Menu for %@" = "%@ 的编辑器菜单";

"Default Shortcut: %@" = "默认快捷方式：%@";
"Default Shortcuts: %@" = "默认快捷方式：%@";
"%@ is bound to “%@”. Custom shortcuts will be preferred." = "%@ 被绑定到“%@”。首选自定义快捷方式。";
"%@ is bound to %@ other commands. Custom shortcuts will be preferred." = "%@ 被绑定到 %@ 其他命令。首选自定义快捷方式。";
"System shortcuts may take precedence over this shortcut." = "系统快捷方式可能优先于此快捷方式。";
"Open System Settings…" = "打开系统设置…";


// Text Action Key Bindings

"Center Selection in Visible Area" = "在可见区域对中选择";
"Scroll Line Up" = "向上滚动行";
"Scroll Line Down" = "向下滚动行";
"Scroll to Beginning of Document" = "滚动到文稿起点";
"Scroll to End of Document" = "滚动到文稿终点";
"Scrolling" = "滚动";
"Delete to Mark" = "删除到标记";
"Select to Mark" = "选择以标记";
"Swap with Mark" = "与标记转换";
"Set Mark" = "设置标记";
"Yank" = "拷贝";
"Yank and Select" = "拷贝并选择";
"Mark & Yank" = "标记并拷贝";
"Move Up" = "向上移动";
"Move Down" = "向下移动";
"Move Up Extending Selection" = "向上移动扩展选择";
"Move Down Extending Selection" = "向下移动扩展选择";
"Move Left" = "向左移动";
"Move Right" = "向右移动";
"Move Forward" = "向前移动";
"Move Backward" = "向后移动";
"Move Left Extending Selection" = "向左移动扩展选择";
"Move Right Extending Selection" = "向右移动扩展选择";
"Move Forward Extending Selection" = "向前移动扩展选择";
"Move Backward Extending Selection" = "向后移动扩展选择";
"Move Word Left" = "向左移动单词";
"Move Word Right" = "向右移动单词";
"Move Word Forward" = "向前移动单词";
"Move Word Backward" = "向后移动单词";
"Move Word Left Extending Selection" = "向左移动单词扩展选择";
"Move Word Right Extending Selection" = "向右移动单词扩展选择";
"Move Word Forward Extending Selection" = "向前移动单词扩展选择";
"Move Word Backward Extending Selection" = "向后移动单词扩展选择";
"Move Subword Left" = "向左移动子词";
"Move Subword Right" = "向右移动子词";
"Move Subword Left Extending Selection" = "向左移动子词扩展选择";
"Move Subword Right Extending Selection" = "向右移动子词扩展选择";
"Move to Beginning of Line" = "移动到行首";
"Move to End of Line" = "移动到行尾";
"Move to Left End of Line" = "移动到左行尾";
"Move to Right End of Line" = "移动到右行尾";
"Move to Beginning of Line Extending Selection" = "移动到行首扩展选择";
"Move to End of Line Extending Selection" = "移动到行尾扩展选择";
"Move to Left End of Line Extending Selection" = "移动到左行尾扩展选择";
"Move to Right End of Line Extending Selection" = "移动到右行尾扩展选择";
"Move to Beginning of Paragraph" = "移动到段首";
"Move to End of Paragraph" = "移动到段尾";
"Move to Beginning of Paragraph Extending Selection" = "移动到段首扩展选择";
"Move to End of Paragraph Extending Selection" = "移动到段尾扩展选择";
"Move Paragraph Forward Extending Selection" = "向前移动段落扩展选择";
"Move Paragraph Backward Extending Selection" = "向后移动段落扩展选择";
"Selection" = "选择";
"Insert Newline" = "插入新行";
"Insert Newline without Extra Action" = "无额外操作插入新行";
"Insert Tab" = "插入制表符";
"Insert Tab without Extra Action" = "无额外操作插入制表符";
"Insert Backtab" = "插入退格制表符";
"Insertions and Indentations" = "插入和缩进";
"Delete Forward" = "向前删除";
"Delete Backward" = "向后删除";
"Delete Word Forward" = "向前删除单词";
"Delete Word Backward" = "向后删除单词";
"Delete Subword Forward" = "向前删除子词";
"Delete Subword Backward" = "向后删除子词";
"Delete to Beginning of Line" = "删除到行首";
"Delete to End of Line" = "删除到行尾";
"Delete to Beginning of Paragraph" = "删除到段首";
"Delete to End of Paragraph" = "删除到段尾";
"Deletions" = "删除";


// Preferences
"Preferences" = "首选项";
"Settings" = "设置";

"Preferences…" = "偏好设置…";
"Settings…" = "设置…";

"General" = "通用";
"Accounts" = "帐户";
"Behaviors" = "行为";
"Files" = "文件";
"Editor" = "编辑器";
"Completions" = "完成";
"Theme" = "主题";
"Extensions" = "扩展";
"Tools" = "工具";
"Advanced" = "高级";
"Servers" = "服务器";
"Keys" = "密钥";

"Default: %@" = "默认：%@";


// General Preferences
"Launcher options" = "启动器选项";
"Projects" = "项目";

"Crash Reports" = "崩溃报告";
"Analytics" = "分析";
"Privacy" = "隐私";
"Data Collection" = "数据收集";

"Software Updates" = "软件更新";

"Beta Updates" = "测试版更新";
"By opting-in, you acknowledge that betas are pre-release software and you may encounter unexpected bugs or behaviors, including data loss." = "选择参与测试，即表示您承认测试版为预发布的软件，您可能会遇到意外的错误或行为，包括数据丢失。";
"I Understand" = "我理解";

"Extension Development" = "扩展开发";

"Help Panic improve %@." = "帮助 Panic 改进 %@。";
"PrivacyURL" = "https://panic.com/privacy";

"Are you sure you want to disable Nova announcements?" = "您确定要禁用 Nova 公告吗？";
"These are meant to inform you about important Nova-related news, and are for exceptional circumstances only." = "这些用于通知您有关 Nova 的重要新闻，且仅用于特殊情况。";

"SoapboxPrivacyURL" = "https://panic.com/privacy/#soapbox";

// Accounts Preferences
"Manage %@ accounts" = "管理 %@ 帐户";

// Editor Preferences
"Custom File Type" = "自定义文件类型";
"File Extension" = "文件扩展";
"Filename / Extension" = "文件名/扩展";

"Syntax" = "语法";
"Plain Text" = "纯文本";

"Insertion Point" = "插入点";
"Line Numbers" = "行编号";
"Code Folding" = "代码折叠";
"Editor Path Bar" = "编辑器路径栏";
"Type and function separators" = "类型和功能分隔符";
"Code Structure Headers" = "代码结构标头";
"Sticky Code Headers" = "粘性代码标头";
"Minimap" = "小地图";
"Map" = "地图";
"Invisible Characters" = "不可见字符";
"Line Highlight" = "行突出显示";
"Editor Status View" = "编辑器状态视图";
"Editor Font options" = "编辑器字体选项";
"Editor Overscroll" = "编辑器 Overscroll";
"Bracket Palette" = "括号面板";
"Color Previews" = "颜色预览";
"Default Text Encoding" = "默认文本编码";
"Default Line Endings" = "默认行尾";
"Comment options" = "注释选项";
"EditorConfig options" = "EditorConfig 选项";
"Preview options" = "预览选项";
"Breakpoint options" = "断点选项";

"Default Syntax" = "默认语法";
"Custom File Types" = "自定义文件类型";
"Completion options" = "完成选项";
"Autocomplete options" = "自动完成选项";
"Language Server options" = "语言服务器选项";

"Indentation options" = "缩进选项";
"Indentation Guides" = "缩进提示线";
"Adjust indentation while typing" = "输入时调整缩进";
"Reformat indentation of pasted text" = "重新格式化粘贴文本的缩进";

"Git Change Markers" = "Git 更改标记";
"Git Authors" = "Git 作者";
"Git Blame" = "Git Blame";

// Behavior Preferences
"New Behavior" = "新行为";
"Manage Behaviors…" = "管理行为…";
"No Custom Behaviors" = "无自定义行为";
"Choose Sound…" = "选择声音…";
"Choose Script…" = "选择脚本…";

"Manage notifications for project events" = "为项目事件管理通知";

// Key Bindings Preferences
"The key combination “%@” is already in use by “%@”." = "按键组合“%@”已经在被“%@”使用。";
"The key combination “%@” is not valid." = "按键组合“%@”无效。";

"Keyboard shortcuts for custom behaviors must not conflict with existing menu items. Please choose another keyboard shortcut." = "自定义行为的键盘快捷方式不得与现有菜单项冲突。请选择另一个键盘快捷方式。";
"Keyboard shortcuts for custom behaviors must include the Command (⌘) modifier. Please choose another keyboard shortcut." = "自定义行为的键盘快捷方式必须包含 Command（⌘）修饰符。请选择另一个键盘快捷方式。";

// Behaviors Preferences
"Starts" = "启动";
"Pauses" = "暂停";
"Generates issues" = "生成问题";
"Generates output" = "生成输出";
"Succeeds" = "成功";
"Fails" = "失败";
"Completes" = "完成";
"Exits unexpectedly" = "意外退出";

// Workspace Preferences
"Sidebar Layouts" = "边栏布局";
"Sidebar Dock options" = "边栏程序坞选项";
"Default Split Direction" = "默认分离方向";
"Open documents with a single-click" = "通过一次点按打开文档";
"Automatically select focused files" = "自动选择聚焦的文件";
"Automatically save documents" = "关闭时自动保存文稿";
"Save files atomically" = "原子保存文件";
"Atomic Save" = "原子保存";
"Markdown Preview options" = "标记预览选项";

// Files Preferences
"Files Sidebar View options" = "文件边栏视图选项";
"Files Sidebar Navigation Controls" = "文件边栏导航控制";
"Find Pasteboard options" = "查找粘贴板选项";
"Dragging and Dropping Files" = "拖放文件";
"Ignored Files" = "忽略的文件";

// Terminal Preferences
"Terminal Font options" = "终端字体选项";
"Terminal Beep" = "终端蜂鸣";
"Terminal Title options" = "终端标题选项";

"Terminal Theme" = "终端主题";
"Terminal ANSI Colors" = "终端 ANSI 颜色";

"Terminal Keyboard options" = "终端键盘选项";

"Terminal Type" = "终端类型";
"Terminal Mouse Events" = "终端鼠标事件";
"Terminal Data Detectors" = "终端数据检测器";

// Theme Preferences
"Themes" = "主题";

"Window Theme" = "窗口主题";
"Editor Theme" = "编辑器主题";
"Dock Icon" = "程序坞图标";

// Servers Preferences
"File Servers" = "文件服务器";

// Keys Preferences
"SSH Keys" = "SSH 密钥";
"Private Keys" = "私钥";

// Transfers Preferences
"File Transfer options" = "文件传输选项";
"Cloud options" = "云选项";
"File Transfer Rules" = "文件传输规则";
"File Transfer Proxy options" = "文件传输代理选项";
"Advanced File Server options" = "高级文件服务器选项";

// Tools Preferences
"Command Line Tool" = "命令行工具";
"CLI tool" = "CLI 工具";
"Environment Variables" = "环境变量";


// Tools

"%@ would like to install its command line tools in /usr/local/bin." = "%@ 想在 /usr/local/bin 中安装其命令行工具。";
"%@ would like to uninstall its command line tools from /usr/local/bin." = "%@ 想在 /usr/local/bin 中卸载其命令行工具。";


// Help

"NOVA_HOMEPAGE_URL" = "/";
"NOVA_BUY_PAGE_URL" = "/buy";
"NOVA_LICENSE_HELP_URL" = "/help";
"NOVA_BUG_REPORTING_URL" = "/help";
"NOVA_RELEASE_NOTES_URL" = "/releases";

"NOVA_LICENSE_MANAGE_URL" = "https://accounts.panic.com/";
"NOVA_REFERENCE_LIBRARY_URL" = "https://library.panic.com/nova";
"NOVA_REFERENCE_LIBRARY_SEARCH_URL" = "https://library.panic.com/search.php";

"PANIC_ELIST_SIGNUP_URL" = "https://elist.panic.com/";

"Error fetching topics from Panic Library" = "从 Panic 库取得主题时出错";


// Launcher

"Recent" = "最近";
"Servers" = "服务器";
"No projects." = "无项目。";
"Remove Project" = "移除项目";
"Remove Projects" = "移除项目";
"New Project" = "新项目";
"Open…" = "打开…";
"Search projects" = "搜索项目";
"Search remote projects" = "搜索远程项目";
"Search local projects" = "搜索本地项目";

"New Group" = "新群组";

"Back to Projects" = "返回项目";
"Move to Projects" = "移动到项目";
"Remove from Projects" = "从项目中移除";

"Locate…" = "定位…";

"The project “%@” could not be opened." = "无法打开项目“%@”。";
"Some projects could not be opened." = "某些项目无法被打开。";
"The selected projects could not be opened." = "所选项目无法打开。";
"The project “%@” could not be located." = "无法找到项目“%@”的位置。";
"Some projects could not be located." = "某些项目无法被找到。";
"The selected projects could not be located." = "所选项目无法被找到。";
"Volume “%@” is unavailable." = "卷“%@”不可用。";
"The file or folder was not found." = "无法找到该文件或文件夹。";
"The item is not a directory." = "该项目不是目录。";
"Are you sure you want to remove %lu projects?" = "您确定要移除 %lu 个项目吗？";
"No files or servers will be deleted." = "不会删除文件或服务器。";
"This action will only remove the project’s shortcut from the Launcher." = "此操作只会从启动器中移除项目的快捷方式。";
"This action will only remove the projects’ shortcuts from the Launcher." = "此操作只会从启动器中移除项目的快捷方式。";


// First Launch

"Skip" = "跳过";
"Are you sure you want to skip setup?" = "您确定要跳过设置吗？";
"You can configure all of the settings covered here later in Preferences." = "您可以稍后在首选项中配置这里涉及的全部设置。";

"No sites found." = "未找到站点。";
"1 site found." = "找到 1 个站点。";
"%@ sites found." = "找到 %@ 个站点。";

"No clips found." = "未找到剪辑。";
"1 clip found." = "1 个剪辑被找到。";
"%@ clips found." = "%@ 个剪辑被找到。";

"Coda 2" = "Coda 2";


// Progress

"%@ remaining" = "%@ 个剩余";
